#+TITLE: Journal Entry - Sunday, February 18 2018
#+AUTHOR: xing wenju
#+IRC: linuxing3 on freenode
#+EMAIL: xingwenju@gmail.com
#+STARTUP: overview


** Codes

*** Define macros 
    
#+srcname: define-macros
#+begin_src emacs-lisp 

;;; with-dir

(defmacro do-in-dir (DIR &rest FORMS)
  "Execute FORMS in DIR."
  (let ((orig-dir (gensym)))
    `(prog2
         (setq ,orig-dir default-directory)
         (progn (cd ,DIR) ,@FORMS)
       (cd ,orig-dir))))

#+end_src

#+RESULTS: define-macros
: do-in-dir


*** Run macros 
    
#+srcname: run-macros
#+begin_src emacs-lisp 
  
(macroexpand '(with-dir "~/.emacs.d"))

#+end_src

#+RESULTS: run-macros
| prog2 | (setq G1830 default-directory) | (progn (cd ~/.emacs.d)) | (cd G1830) |

